## ExcelでできることはPandasで！(1)
* ExcelからPandasへ

* 出典
   * [【作業効率UP】よく使うExcel(エクセル)関数10選 | TechAcademyマガジン](https://techacademy.jp/magazine/9872#sec2)

1. 合計を出したいとき【SUM関数】
2. 条件に当てはまる数値の合計を出したいとき【SUMIF関数】
3. 平均値を出したいとき【AVERAGE関数】
4. 小計やオートフィルタを用いて集計したいとき【SUBTOTAL関数】
5. 最大値を出したいとき【MAX関数】
6. 最小値を出したいとき【MIN関数】

7. 条件に当てはまるセルの数を数えたいとき【COUNTIF関数】
8. 条件に当てはまるセルを表示させたいとき【VLOOKUP関数】
9. 条件によって処理を変えたいとき【IF関数】
10. 文字列を繋げたいとき【CONCATENATE関数】

 * 覚えておきたいExcel関数まとめ

1. 合計を出したいとき【xxx関数】
1. 条件に当てはまる数値の合計を出したいとき【xxx関数】
1. 平均値を出したいとき【xxx関数】
1. 小計やオートフィルタを用いて集計したいとき【xxx関数】
1. 最大値を出したいとき【xxx関数】
1. 最小値を出したいとき【xxx関数】
1. 条件に当てはまるセルの数を数えたいとき【xxx関数】
1. 条件に当てはまるセルを表示させたいとき【xxx関数】
1. 条件によって処理を変えたいとき【xxx関数】
1. 文字列を繋げたいとき【xxx関数】
1. 覚えておきたいPandas関数まとめ

### 1. 合計を出したいとき【SUM関数】
Excel をまだあまり使ったことがない方も、おそらく一度は目にしたことがあるのではないでしょうか？

SUM関数は、指定した範囲内の数値の合計を求める関数です。
= の後に SUM と入力し、その後の引数部分には (範囲内の最初のセル:最後のセル) を入力します。

例えば、B2 から B5 までの数値の合計を B6 に入力したいときは、

> ＝SUM(B2:B5)

という数式を B6 に入力します。

![](pict/SUM-1.png)

[出典](https://techacademy.jp/magazine/9872#sec1)

In [1]:
import pandas as pd
df = pd.read_excel("data/SUM-1.xlsx")
df

   名前  点数
0  一郎  97
1  二郎  79
2  三郎  73
3  四郎  88

In [2]:
df['点数'].sum()

337

In [3]:
df.sum()

名前    一郎二郎三郎四郎
点数         337
dtype: object

In [4]:
df.describe()

          点数
count   4.00
mean   84.25
std    10.50
min    73.00
25%    77.50
50%    83.50
75%    90.25
max    97.00

#### 2. 条件に当てはまる数値の合計を出したいとき【SUMIF関数】
SUMIF関数は、範囲内で指定した条件を満たす数値の合計を求める関数です。
= の後に SUMIF と入力し、その後の引数部分には (検索条件範囲内の最初のセル:最後のセル,検索条件のセル,合計範囲内の最初のセル:最後のセル) を入力します。

例えば、A2 から A9 までの中で、A12 の項目を検索し、C2 から C9 までの中で該当する数値の合計を、B12 に入力したいときは、

![](pict/SUMIF-1.png)

[出典](https://techacademy.jp/magazine/9872#sec1)

In [6]:
import pandas as pd
df = pd.read_excel("data/SUMIF-1.xlsx")
df

   クラス  名前  点数
0    2  夏子  99
1    1  一郎  97
2    1  四郎  88
3    2  秋子  82
4    1  二郎  79
5    2  冬子  78
6    1  三郎  73
7    2  春子  65

In [10]:
df.groupby('クラス').sum()

      点数
クラス
1    337
2    324

### 3. 平均値を出したいとき【AVERAGE関数】
AVERAGE関数は、指定した範囲内の数値の平均値を求める関数です。
= の後に AVERAGE と入力し、その後の引数部分には (範囲内の最初のセル:最後のセル) を入力します。

例えば、B2 から B5 までの数値の平均値を B6 に入力したいときは、

> ＝AVERAGE(B2:B5)

という数式を B6 に入力します。

![](pict/AVERAGE-1.png)

In [11]:
import pandas as pd
df = pd.read_excel("data/SUM-1.xlsx")
df

   名前  点数
0  一郎  97
1  二郎  79
2  三郎  73
3  四郎  88

In [13]:
df.mean()

点数    84.25
dtype: float64

In [15]:
df.describe()

          点数
count   4.00
mean   84.25
std    10.50
min    73.00
25%    77.50
50%    83.50
75%    90.25
max    97.00

### 4. 小計やオートフィルタを用いて集計したいとき【SUBTOTAL関数】
SUBTOTAL関数は、指定した条件を満たすセルの数値を、指定した集計方法で集計し、その集計結果を求める関数です。
= の後に SUBTOTAL と入力し、その後の引数部分には (集計方法を表す数字,範囲内の最初のセル:最後のセル) を入力します。

例えば、C2 から C10 までの数値のを平均値を C12 に入力したいときは、

> ＝SUBTOTAL(1,C2:C10)

という数式を C12 に入力します。
※この場合、C6 と C11 をそれぞれ SUBTOTAL関数を用いて算出しないと、C12 は正しく反映されません。

ちなみに、平均値を求めるときは 1、最大値を求めるときは 4、最小値を求めるときは 5、合計を求めるときは 9 など、集計方法を表す数字を変えることで、いろいろな集計方法に応用できます。

![](pict/g)

[出典](https://techacademy.jp/magazine/9872#sec3)

### 5. 最大値を出したいとき【MAX関数】
MAX関数は、指定した範囲内の数値の最大値を求める関数です。
= の後に MAX と入力し、その後の引数部分には (範囲内の最初のセル:最後のセル) を入力します。

例えば、B2 から B5 までの数値の最大値を B6 に入力したいときは、

> ＝MAX(B2:B5)

という数式を B6 に入力します。


![](pict/MAX-1.png)

[出典](https://techacademy.jp/magazine/9872#sec3)

In [16]:
import pandas as pd
df = pd.read_excel("data/SUM-1.xlsx")
df

   名前  点数
0  一郎  97
1  二郎  79
2  三郎  73
3  四郎  88

In [19]:
df['点数'].max()

97

In [17]:
df.max()

名前    四郎
点数    97
dtype: object

In [18]:
df.describe()

          点数
count   4.00
mean   84.25
std    10.50
min    73.00
25%    77.50
50%    83.50
75%    90.25
max    97.00

### 6. 最小値を出したいとき【MIN関数】
MIN関数は、指定した範囲内の数値の最小値を求める関数です。
= の後に MIN と入力し、その後の引数部分には (範囲内の最初のセル:最後のセル) を入力します。

例えば、B2 から B5 までの数値の最小値を B6 に入力したいときは、

> =MIN(B2:B5)

という数式を B6 に入力します。

![](pict/MIN-1.png)

[出典](https://techacademy.jp/magazine/9872#sec3)

In [20]:
import pandas as pd
df = pd.read_excel("data/SUM-1.xlsx")
df

   名前  点数
0  一郎  97
1  二郎  79
2  三郎  73
3  四郎  88

In [21]:
df['点数'].min()

73

In [22]:
df.min()

名前    一郎
点数    73
dtype: object

In [23]:
df.describe()

          点数
count   4.00
mean   84.25
std    10.50
min    73.00
25%    77.50
50%    83.50
75%    90.25
max    97.00

### 7. 条件に当てはまるセルの数を数えたいとき【COUNTIF関数】
COUNTIF関数は、指定した検索条件に該当するセルの個数を求める関数です。
= の後に COUNTIF と入力し、その後の引数部分には (範囲内の最初のセル:最後のセル,検索条件のセル) を入力します。

例えば、B2 から B5 までの中で、A8 の項目を検索し、該当するセルの個数の合計を、B8 に入力したいときは、

> =COUNTIF(B2:B5,A8)

という数式を B8 に入力します。

![](pict/COUNTIF-1.png)

[出典](https://techacademy.jp/magazine/9872#sec3)

In [24]:
import pandas as pd
df = pd.read_excel("data/COUNTIF-1.xlsx")
df

   名前 追試の有無
0  一郎     ×
1  二郎     〇
2  三郎     〇
3  四郎     ×

In [26]:
df[df['追試の有無'] == '〇'].count()

名前       2
追試の有無    2
dtype: int64

In [27]:
df[df['追試の有無'] == '×'].count()

名前       2
追試の有無    2
dtype: int64

In [28]:
df.groupby('追試の有無').count()

       名前
追試の有無
×       2
〇       2

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
type(df.groupby('追試の有無').count())

pandas.core.frame.DataFrame

### 8. 条件に当てはまるセルを表示させたいとき【VLOOKUP関数】
VLOOKUP関数は、指定した範囲内で検索条件に一致した数値や文字列を表示させる関数です。
= の後に VLOOKUP と入力し、その後の引数部分には (検索条件のセル,範囲内の最初のセル:最後のセル,列番号,検索方法の指定) を入力します。

例えば、 A2 から C5 までの中で、キーワード”二郎” を検索して、2列目 の中から該当する数値を抽出して、B8 に表示させたいときは、

=VLOOKUP(“二郎”,A2:C5,2,FALSE)

という数式を B8 に入力します。

数式の最後に出てきた FALSE ですが、これは検索値と完全に一致する値のみを検索するという指定です。
ちなみに、検索方法の指定を TRUE にすると、検索値と一致する値がない場合、検索値に一番近い値が検索されます。

![](pict/VLOOKUP-1.png)

[出典](https://techacademy.jp/magazine/9872#sec3)

In [79]:
import pandas as pd
df = pd.read_excel("data/VLOOKUP-1.xlsx")
df

      名前    点数 追試の有無
0     一郎  97.0     ×
1     二郎  79.0     〇
2     三郎  73.0     〇
3     四郎  88.0     ×
4    NaN   NaN   NaN
5  追試対象者   NaN   NaN
6     二郎  79.0   NaN

In [80]:
df.dtypes

名前        object
点数       float64
追試の有無     object
dtype: object

In [84]:
import numpy as np
df = pd.read_excel('data/VLOOKUP-1.xlsx', dtype={'点数': str})
df

      名前   点数 追試の有無
0     一郎   97     ×
1     二郎   79     〇
2     三郎   73     〇
3     四郎   88     ×
4    NaN  NaN   NaN
5  追試対象者  NaN   NaN
6     二郎   79   NaN

In [88]:
import numpy as np
df = pd.read_excel('data/VLOOKUP-1.xlsx', dtype={'点数': object})
df

      名前   点数 追試の有無
0     一郎   97     ×
1     二郎   79     〇
2     三郎   73     〇
3     四郎   88     ×
4    NaN  NaN   NaN
5  追試対象者  NaN   NaN
6     二郎   79   NaN

In [89]:
df.dtypes

名前       object
点数       object
追試の有無    object
dtype: object

In [90]:
df.loc[:3]

   名前  点数 追試の有無
0  一郎  97     ×
1  二郎  79     〇
2  三郎  73     〇
3  四郎  88     ×

In [91]:
df = df.loc[:3]
df

   名前  点数 追試の有無
0  一郎  97     ×
1  二郎  79     〇
2  三郎  73     〇
3  四郎  88     ×

In [92]:
df['点数'].dtype

dtype('O')

In [94]:
df['点数'].sum()

337

In [96]:
df[df['名前'] == "二郎"]

   名前  点数 追試の有無
1  二郎  79     〇

In [97]:
df[df['名前'] == "二郎"]['点数']

1    79
Name: 点数, dtype: object

### 9. 条件によって処理を変えたいとき【IF関数】
IF関数は、指定した条件を満たしているかいないかに応じて、セルに表示する内容を変える関数です。
= の後に IF と入力し、その後の引数部分には (条件式,条件を満たす場合に表示すべき内容,条件を満たさない場合に表示すべき内容) を入力します。

例えば、B2 が 80より下である ときは ○、80より下でない ときは × を、C2 に表示させたいときは、

> =IF(B2<80,”○”,”×”)

という数式を C2 に入力します。

ちなみに、80より大きいという条件は [セル]>80、80より小さいという条件は [セル]<80、80以下という条件は [セル]<=80、80と同等という条件は [セル]=80、80と等しくないという条件は [セル]<>80 で表すことができます。

![](pict/IF-1.png)

[出典](https://techacademy.jp/magazine/9872#sec3)

In [31]:
import pandas as pd
df = pd.read_excel("data/IF-1.xlsx")
df

   名前  点数
0  一郎  97
1  二郎  79
2  三郎  73
3  四郎  88

[python - How to add an empty column to a dataframe? - Stack Overflow](https://stackoverflow.com/questions/16327055/how-to-add-an-empty-column-to-a-dataframe)

In [32]:
df['追試の有無'] = ''
df

   名前  点数 追試の有無
0  一郎  97
1  二郎  79
2  三郎  73
3  四郎  88

[Pandas/Python: Set value of one column based on value in another column - Stack Overflow](https://stackoverflow.com/questions/49161120/pandas-python-set-value-of-one-column-based-on-value-in-another-column)

In [33]:
df[df['点数'] < 80]

   名前  点数 追試の有無
1  二郎  79
2  三郎  73

In [45]:
df.loc[df['点数'] < 80, '点数']

1    79
2    73
Name: 点数, dtype: int64

In [50]:
df.loc[df['点数'] < 80, '追試の有無'] = '〇'
df

   名前  点数 追試の有無
0  一郎  97
1  二郎  79     〇
2  三郎  73     〇
3  四郎  88

In [51]:
df.loc[df['点数'] >= 80, '追試の有無'] = '×'
df

   名前  点数 追試の有無
0  一郎  97     ×
1  二郎  79     〇
2  三郎  73     〇
3  四郎  88     ×

### 10. 文字列を繋げたいとき【CONCATENATE関数】
CONCATENATE関数は、指定した複数のセルに入力されている文字列を、一つの文字列に連結させる関数です。
= の後に CONCATENATE と入力し、その後の引数部分には (連結させて最初にくる文字列のセル:最後にくる文字列のセル) を入力します。

例えば、B3 の文字列の後に C3 の文字列を連結させたものを、A8 に入力したいときは、

> =CONCATENATE(B3,C3)

という数式を A8 に入力します。

![](pict/CONCATENATE-1.png)

[出典](https://techacademy.jp/magazine/9872#sec3)

In [99]:
import pandas as pd
df = pd.read_excel("data/CONCATENATE-1.xlsx")
df

      Unnamed: 0 Unnamed: 1 Unnamed: 2
0           出席番号          姓          名
1              1         一宮         一郎
2              2         二宮         二郎
3              3         三宮         三郎
4              4         四郎         四郎
5  今日の日直は出席番号1番の        NaN        NaN
6           一宮一郎        NaN        NaN

In [101]:
df = pd.read_excel("data/CONCATENATE-1.xlsx", skiprows = 1)
df

            出席番号    姓    名
0              1   一宮   一郎
1              2   二宮   二郎
2              3   三宮   三郎
3              4   四郎   四郎
4  今日の日直は出席番号1番の  NaN  NaN
5           一宮一郎  NaN  NaN

In [102]:
df = pd.read_excel("data/CONCATENATE-1.xlsx", skiprows = 1)[:4]
df

  出席番号   姓   名
0    1  一宮  一郎
1    2  二宮  二郎
2    3  三宮  三郎
3    4  四郎  四郎

In [103]:
df['姓'] + df['名']

0    一宮一郎
1    二宮二郎
2    三宮三郎
3    四郎四郎
dtype: object

In [104]:
df['姓名'] = df['姓'] + df['名']
df

  出席番号   姓   名    姓名
0    1  一宮  一郎  一宮一郎
1    2  二宮  二郎  二宮二郎
2    3  三宮  三郎  三宮三郎
3    4  四郎  四郎  四郎四郎

In [114]:
df.to_csv('data/new_file.csv', encoding='cp932')

In [124]:
dfx = pd.read_csv('data/new_file.csv', encoding='cp932').drop(columns = ['Unnamed: 0'])
dfx

   出席番号   姓   名    姓名
0     1  一宮  一郎  一宮一郎
1     2  二宮  二郎  二宮二郎
2     3  三宮  三郎  三宮三郎
3     4  四郎  四郎  四郎四郎

In [105]:
df.loc[0]

出席番号       1
姓         一宮
名         一郎
姓名      一宮一郎
Name: 0, dtype: object

In [107]:
pd.DataFrame(df.loc[0])

         0
出席番号     1
姓       一宮
名       一郎
姓名    一宮一郎

In [108]:
pd.DataFrame(df.loc[0]).T

  出席番号   姓   名    姓名
0    1  一宮  一郎  一宮一郎

1. 合計を出したいとき【sum】
1. 条件に当てはまる数値の合計を出したいとき【条件式、sum】
1. 平均値を出したいとき【mean】
1. 小計やオートフィルタを用いて集計したいとき【groupby】
1. 最大値を出したいとき【max】
1. 最小値を出したいとき【min】
1. 条件に当てはまるセルの数を数えたいとき【count】
1. 条件に当てはまるセルを表示させたいとき【条件式】
1. 条件によって処理を変えたいとき【条件式】
1. 文字列を繋げたいとき【文字列演算】